Revit 2027 API
PanelScheduleTemplate.SetTableData Method
 Assigns table data to this template
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetTableData(
	PanelScheduleData Data
)
Public Sub SetTableData (
	Data As PanelScheduleData
)
public:
void SetTableData(
	PanelScheduleData^ Data
)
member SetTableData :
        Data : PanelScheduleData -> unit
Parameters
Data PanelScheduleData
 The panel schedule data
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace